# p64， 3.17
x <- c(13, 14, 20, 17, 15, 21)
p <- c(rep(1/6, 6)) # 假设均匀，所以p都为1/6
n <- sum(x)
X2 <- sum((x - n * p)^2/(n * p)); X2
X <- qchisq(1 - 0.01, 6 - 0 - 1); X # 阿尔伐 = 0.01 k = 6, r = 0 , X2 < X 所以不拒绝原假设
chisq.test(x, p = p) # p-value > 0.01， 所以不拒绝原假设

# 例1
x <- c(5, 10, 15, 20, 30, 40, 50, 60, 70, 90, 120); x
y <- c(6, 10, 10, 13, 16, 17, 19, 23, 25, 29, 46); y
### 1: 求a帽子，b帽子
lm(y~x) -> uuu; uuu # 建立线性模型, a帽子 5.3444, b帽子 0。3043
summary(uuu) # b帽子：x：0.30434, a帽子: 5.3444
### 2 回归方程 y帽子 = 5.34443 + 0.30434x

### 3. F检验 为 F-statistic 242.9 , 因为p-value:8.094e-08 远小于0.05, 所以拒绝b = 0, 回归显著
### F = Sr/(Se * sqrt(n - 2))

### 4. x = 75 的点预测  y帽子在75处的值为 28.16961
### 在 x = 75处0.95的置信区间为[22.73809, 33.60114]
confint(uuu)
x0 <- data.frame(x = 75); x0
predict(uuu, x0, interval = 'prediction', level = 0.95)

# 例p219, 习题5
x <- c(seq(150, 260, 10)); x
y <- c(56.9, 58.3, 61.6, 64.6, 68.1, 71.3, 74.1, 77.4, 80.2, 82.6, 86.4, 89.7);y
nnn <- lm(y~x); nnn
summary(nnn)
confint(nnn) # a的置信区间：[8.3881132, 12.1776210], b置信区间:[0.2948716, 0.3131004]
### b是x的系数， a是截距

# p93, 4.6
x <- c(30, 35, 38, 25, 40, 32, 26, 29, 36, 20);x
y <- c(28, 30, 35, 18, 38, 29, 25, 24, 31, 15);y
xxx <- lm(y~x)
summary(xxx)
confint(xxx)
x0 <- data.frame(x = 35)
predict(xxx, x0, interval = 'prediction', level = 0.95) # fit: 拟合值，y帽子。 

#p93, 4.7
x <- c(5, 8, 10, 20, 30, 40, 50, 60, 65, 90, 120)
y <- c(4, 6, 8, 13, 16, 17, 19, 25, 26, 29, 46)
model <- lm(y~x)
summary(model)
confint(model, level = 0.95)
