#1
#第一题也算错了，分母不是5，少了平方，是25，
# 所以a等于1
# 2
# 第二题算错了不是-3，是3
# ，c塔等于 1/3
# 4
x <- c(21.6, 17.5, 18.3, 19.2, 20.4);x
y <- c(29.2, 32.8, 25.0, 24.6, 26.7);y
t.test(x,y)
  
# 6
x <- c(68, 83, 53, 64, 70, 84, 60, 72, 51)
y <- c(288, 293, 323, 286, 394, 343, 290, 354, 283)
uuu <- lm(y~x)
summary(uuu)
x0 <- data.frame(x = 76); x0
predict(uuu, x0, interval = 'prediction', level = 0.95)

#7
x1 <- c(29.2, 19.0, 18.8, 23.5, 27.7, 27.2)
x2 <- c(27.3, 19.7, 18.4, 23.4, 29.2, 25.6)
x3 <- c(18.8, 23.8, 18.6, 15.4, 16.7, 20.9)
x4 <- c(21.0, 17.4, 19.5, 19.6, 17.2, 18.7)
n1 <- length(x1); n2 <- length(x2); n3 <- length(x3); n4 <- length(x4)
x <- c(x1, x2, x3, x4); x
a <- rep(1:4, c(n1, n2, n3, n4)); a
A <- factor(a); A # 要因子化
qqq <- aov(x~A); qqq 
summary(qqq)

#5
x <- c(40, 64, 46, 36, 30)
p <- c(1/5, 1/5, 1/5, 1/5, 1/5)
n <- sum(x)
X2 <- sum((x - n * p)^2 / n * p); X2
